# OBJImportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
OBJImportOptions Constructor
OBJImportOptions Class See Also
---
Constructs a new instance of OBJImportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public OBJImportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
OBJImportOptions()
```

# See Also
OBJImportOptions Class
OBJImportOptions Overload
Autodesk.Revit.DB Namespace